chat_system_550783377_actor_description=King Mark. Your King.
chat_system_550783377_switch_0_header_2=^?^My friend, [player], waste no time - every second is critical. Please, get to Murock and save my little Amelie.
chat_system_550783377_snap_0_question=^?^We shall issue an order about fulfilling all the dwarven king's claims immediately! An alliance with Torn Digor and his dwarves is of the utmost urgency, and indeed we must assist the mountain nation in overcoming the Demon invasion.<br>But now I must give you an even more important errand. It's clearly impossible to find a better searcher than you, and there has been a loss more precious to me than all the treasures of the world! Nevertheless, I do not give you this as an order, as your king. Instead, I apply for your help as an inconsolable father... I ask you not as a faithful servant, but as a true friend...
chat_system_550783377_snap_0_answer_0=^?^I don't understand, Your Majesty...
chat_system_550783377_snap_1_question=^?^My only daughter and heiress, little Amelie, given to us by the grace of gods... She... she has been kidnapped!<br>The elves, these rascals, sent us ambassadors with an alleged purpose of resolving some questions about the Islands of Freedom, which had been a stumbling block in Darion-Ellinias relations for a long time...<br>Three years ago, Governor Thompson sold the Eastern Islands to the elves, in order that he might not be entirely under the power of Darion. Of course we couldn't recognize this deal, because the islands are a part of our territory!
chat_system_550783377_snap_1_answer_0=^?^So why did the elven ambassadors come?
chat_system_550783377_snap_2_question=^?^They came under the pretenses of canceling the treaty with the governor, and by our consent to return those islands to Darion, to which they have always belonged and always will!<br>But in reality they had quite another purpose! Under cover of the night, these guileful "ambassadors" put our guards into hypnotic slumber, entered my daughter's room and kidnapped Amelie! While the guards still slept, they escaped, leaving upon their ship to none knows where.
chat_system_550783377_snap_2_answer_0=^?^I see. It's truly heartbreaking, Your Majesty...
chat_system_550783377_snap_3_question=^?^I don't know what to think of it. I surely can't imagine that Queen Violetta could dare to blackmail us. The elves have always been noble allies.<br>Go to Ellinia, to Daloer, and talk to Violetta. Find out the reason behind this cruel act. And, I beg you, [player], bring me back my daughter.<br>I have commissioned a ship, the "Sea Swallow" - it awaits you in the port.
chat_system_550783377_snap_3_answer_0=^?^Ok, I got it. I'll find Amelie, Your Majesty!
chat_system_550783377_snap_4_question=^?^Is it you, [player]? Do you bring news? If not, then leave me in my solitude... I grieve for my little lost Amelie...
chat_system_550783377_snap_4_answer_0=^?^I have news from Ellinia, Your Majesty! (Tell about Karador, Violetta's recovering, and that you're going to travel to Murock through the Dragons' Labyrinth.)
chat_system_550783377_snap_4_answer_1=^?^I have news, Your Majesty! (Tell about Karador, Violetta's recovering, and that you're going to travel to Murock through the Dragons' Labyrinth.)
chat_system_550783377_snap_4_answer_2=^?^I've been in Ellinia and talked to Queen Violetta, Your Majesty!
chat_system_550783377_snap_4_answer_3=^?^Have you heard the name "Karador" before, Your Majesty? He is a powerful mage, who had tricked the mind of the elven queen.
chat_system_550783377_snap_4_answer_4=^?^Don't worry, I give you my word that I shall return her to your side!
chat_system_550783377_snap_8_question=^?^General Karador must have been harboring ill will and hatred against our nation, plotting revenge. Thankfully, you've destroyed the Dark Crystal and restored good relations with the elves. This is good news.<br>Still it is horrible to think what need the orcs might have for my daughter! You will need to go through the Dragons' Labyrinth and bring her back. I believe in you, [player]!
chat_system_550783377_snap_8_answer_0=^?^But the Dragons' Labyrinth has been closed by the dwarves. I shall need the portal keys.
chat_system_550783377_snap_9_question=^?^I doubt this will stop you. I'm sure that King Torn Digor wouldn't refuse under the circumstances. Go as soon as possible - but do not think that I would let you go without granting you a just reward for your service.<br>Kneel and hear the voice of your king, Knight [player]! Your Majesty, King of Darion, Mark Leonard the Second confers upon you a new title of nobility, and names you our friend and support for your services to Darion and to me personally! Arise, [rank], and honorably take up the regalia that is incumbent upon you.<br>Yes, and before you depart, please visit our barracks. I believe our knights and horsemen will be useful to you in this campaign.<br>[reward]
chat_system_550783377_snap_9_answer_0=^?^Thank you, Your Majesty, I'll be leaving immediately!
chat_system_550783377_snap_11_question=^?^General Karador must have been harboring ill will and hatred against our nation, plotting revenge. Thankfully, you've destroyed the Dark Crystal and restored good relations with the elves. This is good news.<br>Still it is horrible to think what need the orcs might have for my daughter! I know that traveling through the Labyrinth was a trial most difficult, [player]! But I believe in you, and I believe that you will bring Amelie back!
chat_system_550783377_snap_11_answer_0=^?^Yes. I'll do my best to save the princess!
chat_system_550783377_snap_12_question=^?^Go as soon as possible - but do not think that I'll let you go without granting you a just reward for your service.<br>Kneel and hear the voice of your king, Knight [player]! Our Majesty, King of Darion, Mark Leonard the Second confers upon you a new title of nobility, and names you our friend and support for your services to Darion and to me personally! Arise, [rank] and honorably take up the regalia that is incumbent on you.<br>Yes, and before you depart, please visit our barracks. I believe our knights and horsemen will be useful to you in this campaign.<br>[reward]
chat_system_550783377_snap_12_answer_0=^?^Thank you, Your Majesty, I'll be leaving immediately!
chat_system_550783377_snap_5_question=^?^Did you call her to account? Come on, tell me, what is going on there, where's Amelie?
chat_system_550783377_snap_5_answer_0=^?^I'm sorry, Your Majesty, but we can't get any sense out of the queen as yet...<br>Her mind is captive to a powerful mage. Under his influence, she ordered her people to kidnap your daughter. Alas, we don't know anything about your daughter yet.
chat_system_550783377_snap_6_question=^?^Well, this must be my bitter lot as a father... I beg you, help the elves, and return the queen to her senses! This would be a priceless service to all the elves, and surely they will return my daughter to me! I'm prepared to give everything I have, just to see her again, safe and sound. Do you hear me? Everything!
chat_system_550783377_snap_6_answer_0=^?^Yes, of course. I shall see to the queen's recovery, and tell her your words.
chat_system_550783377_snap_6_answer_1=^?^Have you heard the name "Karador" before, Your Majesty? He is a powerful mage, who tricked the mind of the elven queen, and ordered the kidnapping of your daughter, the princess.
chat_system_550783377_snap_7_question=^?^Karador? Of course I know this name. This was the name of Darion's greatest tactician and strategist, general Karador. According to the royal chronicles, his career was quite amazing: he made his way from a young officer under King Larg Leonard to an outstanding commander under King Vilor, all in under twenty years. He has written priceless treatises on tactics, the art of a castles' siege and defense... He was a genius, and perhaps a bit insane...
chat_system_550783377_snap_7_answer_0=^?^Insane?
chat_system_550783377_snap_10_question=^?^Yes, exactly. During the plague which the necromancers cast down upon Darion, Karador lost all his family and friends - everyone he knew and loved. He swore to punish those adherents of Death, and soon came his chance. The Paladin's Order entrusted to him one of its finest strike troops, and soon enough, this talented young man rose ever higher in the ranks. He never lost a battle, and not a single necromancer had managed to escape his wrath...<br>Later, when the war with the necromancers was over, His Majesty sent the young general to Ellinia, to stop the orcs bent on the elimination of the elves, who themselves had been weakened by war. That was when the vicious nature of the general first emerged...
chat_system_550783377_snap_10_answer_0=^?^(Listen further...)
chat_system_550783377_snap_10_header_0=^?^He accused the orcs of helping the necromancers. It made sense at the time, of course! They both used Titan's magic, and as for the necromancers, after fleeing Darion they found shelter in the Land of Death, which had been created by the Titan Seth, who the orcs worship...<br>And so Karador began to take revenge. By his order all orcs were captured, including women and children, and were sent to the executioners. As they writhed in agony, Karador stood on, impartially watching their suffering. Even the elves begged him to stop, to end the suffering of the innocent, though the innocent were their sworn enemies... But Karador immediately accused all who spoke against him of helping the orcs and necromancers, and put them into his torture chambers as well...<br>Eventually the general was betrayed. He was put to sleep by some well-meaning deceiver, and returned to Darion. In the main square, then-King Vilor Eliar declared the sentence, and the general was immediately executed for cruelty towards captives and numerous murders. Thus the life of a great commander came to a sad end.<br>But enough about Karador. What am I to do now? How is my daughter related to any of this?
